app/Controllers/EDMSController.php

INSERT INTO `departments` (`department_name`, `code`) VALUES ('TECNICAL', 'TECH01')
---

                // Save the data
                $model = model(DepartmentsModel::class);
                $model->save([
                    'department_name'=> $data['department_name'],
                    'code'=> $data['department_code'],
                ]);