app/Models/AuthModel.php

SELECT *
FROM `auth`
WHERE `username` = 'Sky7'
 LIMIT 1
---
        public function getUsers($slug=false){
            if($slug === false){
                $this->findAll();
            }

            // If the $Slug is given then get the user details
            return $this->where(['username'=> $slug])->first();