app/Models/DepartmentsModel.php

        public function getDepartments($id=null){
            if($id === null){
                return $this->findAll();
            }

            // If the $Slug is given then get the user details
            return $this->where(['id'=> $id])->first();
---
SELECT *
FROM `departments`
SELECT *
FROM `departments`
WHERE `id` = '1'
 LIMIT 1

        public function checkDeptmtCode($department_code){
            // If the $Slug is given then get the user details
            return $this->where(['code'=> $department_code])->first();
---
SELECT *
FROM `departments`
WHERE `code` = 'TECH01'
 LIMIT 1

        public function checkDeptmtName($department_name){
            // If the $Slug is given then get the user details
            return $this->where(['department_name'=> $department_name])->first();
---
SELECT *
FROM `departments`
WHERE `department_name` = 'TECNICAL'
 LIMIT 1

        public function activateDepartment($department_id, $updated_data){
            return $this->update(['id'=>$department_id], $updated_data);
---
UPDATE `departments` SET `activation_status` = 1
WHERE `id` = '2'
AND `departments`.`id` IN ('departments')