app/Models/NewsModel.php

SELECT *
FROM `news`
SELECT *
FROM `news`
WHERE `id` = 0
 LIMIT 1
---
        public function getNews($slug=false){
            // Check if there is no slug provided then load the data
            if($slug === false){
                // use the findAll() function to roald all the data
                return $this->findAll();
            }

            // In case the id for a specific item is provided then be retrieved instead of all
            return $this->where(["id" =>$slug])->first();

DELETE FROM `news`
WHERE `id` = '32'
---
        public function deleteNews($slug){
            return $this->where('id', $slug)->delete();

UPDATE `news` SET `title` = 'Nigga gave them a hatrick', `body` = 'Akasayi SC is back on track after winning all its games on Matchday 10.', `created_on` = '2024-12-30'
WHERE `news`.`id` IN ('14')
---
        public function updateNews($slug, $updated_data){

            return $this->update(['id' => $slug], $updated_data);